---
kind: type
id: T:Autodesk.Revit.DB.Architecture.RailTagentJoinOption
source: html/ea503e96-b3eb-172e-acb4-180bfad56652.htm
---
# Autodesk.Revit.DB.Architecture.RailTagentJoinOption

The tangent joins of the rails.

## Syntax (C#)
```csharp
public enum RailTagentJoinOption
```